
[
  {
    "id": "skunk",
    "name": "Dog Sprayed by Skunk",
    "icon": "SprayCan",
    "description": "Steps to take if your dog gets sprayed by a skunk.",
    "immediateActions": [
      "Keep your dog outside to prevent the odor from spreading indoors.",
      "Check your dog's eyes. If they are red or irritated, flush them gently with cool water or a pet-safe eyewash."
    ],
    "steps": [
      {
        "title": "Gather Supplies",
        "details": "You'll need: Rubber gloves, old towels, skunk shampoo (commercial or homemade). For homemade: 1 quart of 3% hydrogen peroxide solution, 1/4 cup baking soda, 1 teaspoon liquid dish soap. Mix just before use and do not store.",
        "important": true
      },
      {
        "title": "Protect Yourself & Dog's Eyes",
        "details": "Wear rubber gloves and old clothes. Before washing, you can apply a small strip of petroleum jelly or mineral oil around your dog’s eyes to prevent shampoo from getting in."
      },
      {
        "title": "Wash Your Dog",
        "details": "Wet your dog thoroughly. Lather with the skunk shampoo, avoiding eyes and mouth. Let the solution sit for 5-10 minutes before rinsing completely. Repeat if necessary."
      },
      {
        "title": "Rinse Thoroughly",
        "details": "Rinse your dog extremely well. Any residue can irritate the skin."
      },
      {
        "title": "Towel Dry",
        "details": "Dry your dog with old towels. Keep them warm."
      },
      {
        "title": "Clean Contaminated Items",
        "details": "Wash any contaminated items (collars, leashes, your clothes) with a de-skunking solution or strong detergent."
      },
      {
        "title": "Monitor Your Dog",
        "details": "Watch for any signs of illness, excessive drooling, or irritation. Contact your vet if you have concerns."
      }
    ],
    "relevantContacts": [
      { "name": "Your Veterinarian", "number": "Your Vet's Phone", "website": "Your Vet's Website" },
      { "name": "Pet Poison Helpline (if ingested solution or severe reaction)", "number": "855-764-7661" }
    ]
  },
  {
    "id": "found_stray",
    "name": "Found a Stray Animal",
    "description": "Guidance on what to do if you find a lost or stray pet.",
    "steps": [
      { "title": "Approach Cautiously", "details": "The animal may be scared or injured. Approach slowly, speak calmly, and avoid direct eye contact initially." },
      { "title": "Check for Identification", "details": "Look for a collar with tags (name, phone number, rabies tag). If safe, try to contain the animal in a secure area (fenced yard, crate)." },
      { "title": "Provide Water", "details": "Offer fresh water. Avoid feeding immediately unless the animal appears emaciated, as it could cause digestive upset." },
      { "title": "Notify Local Shelters & Vets", "details": "Contact San Diego Humane Society, County Animal Services, and local vet clinics. Provide a description, location found, and any ID info." },
      { "title": "Use Social Media & Online Lost Pet Finders", "details": "Post on platforms like PawBoost, Petco Love Lost, Nextdoor, Facebook lost pet groups for San Diego." },
      { "title": "Scan for Microchip", "details": "Take the animal to a vet clinic or shelter to be scanned for a microchip. This is a free service." }
    ]
  }
]
