
[
  {
    "id": "skunk",
    "name": "Skunk Spray",
    "icon": "SprayCan",
    "description": "What to do if your pet gets sprayed by a skunk.",
    "immediateActions": [
      "Keep your pet outdoors to prevent the smell from spreading inside.",
      "Check your pet's eyes for redness or irritation. If affected, rinse gently with cool water or pet-safe eyewash."
    ],
    "steps": [
      {
        "title": "Prepare De-Skunking Solution",
        "details": "Mix: 1 quart of 3% hydrogen peroxide solution (check expiry), ¼ cup baking soda, 1-2 teaspoons of mild liquid dish soap. Mix fresh for each use; do not store.",
        "important": true
      },
      {
        "title": "Apply Solution",
        "details": "Wearing rubber gloves, lather your pet with the solution, avoiding eyes and mouth. Work it deep into the fur. Let it sit for about 5 minutes. Do NOT leave unattended.",
        "important": true
      },
      {
        "title": "Rinse Thoroughly",
        "details": "Rinse your pet completely with lukewarm water. Ensure all solution is removed, as peroxide can bleach fur and irritate skin if left too long."
      },
      {
        "title": "Shampoo",
        "details": "Follow up with a regular pet shampoo to remove any residue."
      },
      {
        "title": "Towel Dry and Keep Warm",
        "details": "Dry your pet thoroughly with towels and keep them in a warm place."
      },
      {
        "title": "Monitor Your Pet",
        "details": "Watch for any signs of illness, vomiting, or excessive irritation. Skunk spray can sometimes cause anemia in dogs. Contact your vet if concerned."
      }
    ],
    "relevantContacts": [
      {
        "name": "Your Veterinarian",
        "number": "Lookup your vet's number",
        "website": ""
      },
      {
        "name": "Pet Poison Helpline",
        "number": "855-764-7661",
        "website": "https://www.petpoisonhelpline.com"
      }
    ]
  },
  {
    "id": "found_stray",
    "name": "Found a Stray Pet",
    "icon": "PawPrint",
    "description": "Steps to take if you find a lost dog or cat.",
    "immediateActions": [
      "Approach cautiously and speak calmly. Offer water if the animal seems distressed or thirsty.",
      "Check for any visible identification tags (collar, name tag, rabies tag)."
    ],
    "steps": [
      {
        "title": "Ensure Safety",
        "details": "Keep the animal contained in a safe place (e.g., fenced yard, carrier, spare room) away from your own pets initially."
      },
      {
        "title": "Check for Microchip",
        "details": "Take the pet to a local vet clinic or animal shelter to have it scanned for a microchip. This is often a free service."
      },
      {
        "title": "Notify Local Shelters & Animal Control",
        "details": "Contact San Diego Humane Society, County Animal Services, and shelters in your immediate area. Provide a description of the animal, where it was found, and your contact info."
      },
      {
        "title": "Post Online",
        "details": "Use social media (Facebook lost & found pet groups for San Diego, Nextdoor, PawBoost, Petco Love Lost) to post a photo and description of the found pet."
      },
      {
        "title": "Put Up Flyers",
        "details": "Place 'Found Pet' flyers in the neighborhood where the animal was found."
      },
      {
        "title": "Legal Holding Period",
        "details": "Be aware of local regulations regarding stray animals. There's usually a holding period before a found pet can be considered for rehoming."
      }
    ],
    "relevantContacts": [
      {
        "name": "San Diego Humane Society",
        "number": "(619) 299-7012",
        "website": "https://www.sdhumane.org"
      },
      {
        "name": "San Diego County Animal Services",
        "number": "(619) 767-2675",
        "website": "https://www.sddac.com"
      }
    ]
  }
]
